Validation_Cases/CompressibleNACA0012/Coarse_negSA_Ct3=0/system/PaxHeaders.21019/controlDict
30 mtime=1566338769.986474389
30 atime=1566338770.650476847
30 ctime=1566338769.990474403
