Validation_Cases/CompressibleNACA0012/Coarse_negSA_Ct3=0/constant/PaxHeaders.21019/geometry
30 mtime=1559334475.061312757
29 atime=1566322305.89789977
30 ctime=1565968659.745945481
