Validation_Cases/CompressibleNACA0012/Coarse_negSA_Ct3=0/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;

    //transport       const;
    transport       sutherland;

    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    //energy          sensibleInternalEnergy;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   	28.9;
    }
    thermodynamics
    {
        Cp          	1005;
        Hf          	0;
    }
    transport
    {
        mu          	1.82e-05;
        Pr          	0.71;

	As 		1.4584E-6;
	Ts 		110.4;
    }
}

// ************************************************************************* //
